Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/atdf/PIC32CM2532LE00100.atdf
      <value-group name="EIC_DPRESCALER__STATES">
        <value name="LFREQ3" caption="3 low frequency samples" value="0"/>
        <value name="LFREQ7" caption="7 low frequency samples" value="1"/>
      </value-group>
      <value-group name="EIC_DPRESCALER__TICKON">
        <value name="CLK_GCLK_EIC" caption="Clocked by GCLK" value="0"/>
        <value name="CLK_LFREQ" caption="Clocked by Low Frequency Clock" value="1"/>
      </value-group>
    </module>
    <module name="EVSYS" id="03601" version="2a1" caption="Event System Interface">
      <register-group name="CHANNEL" size="0x8">
        <register name="CHANNEL" offset="0x0" rw="RW" size="4" initval="0x00008000" caption="Channel n Control">
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x7F"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="EVSYS_CHANNEL__EDGSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000"/>
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
        </register>
        <register name="CHINTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:CHINTENCLR" initval="0x00" caption="Channel n Interrupt Enable Clear">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Disable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Disable" mask="0x2"/>
        </register>
        <register name="CHINTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:CHINTENSET" initval="0x00" caption="Channel n Interrupt Enable Set">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Enable" mask="0x2"/>
        </register>
        <register name="CHINTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:CHINTFLAG" initval="0x00" caption="Channel n Interrupt Flag Status and Clear">
          <bitfield name="OVR" caption="Channel Overrun" mask="0x1"/>
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x2"/>
        </register>
        <register name="CHSTATUS" offset="0x7" rw="R" size="1" initval="0x01" caption="Channel n Status">
          <bitfield name="RDYUSR" caption="Ready User" mask="0x1"/>
          <bitfield name="BUSYCH" caption="Busy Channel" mask="0x2"/>
        </register>
      </register-group>
      <register-group name="EVSYS" caption="Event System Interface">
        <register name="CTRLA" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SWEVT" offset="0x4" rw="W" size="4" initval="0x00000000" caption="Software Event">
          <bitfield name="CHANNEL0" caption="Channel 0 Software Selection" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Channel 1 Software Selection" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Channel 2 Software Selection" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Channel 3 Software Selection" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Channel 4 Software Selection" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Channel 5 Software Selection" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Channel 6 Software Selection" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Channel 7 Software Selection" mask="0x80"/>
          <bitfield name="CHANNEL8" caption="Channel 8 Software Selection" mask="0x100"/>
          <bitfield name="CHANNEL9" caption="Channel 9 Software Selection" mask="0x200"/>
          <bitfield name="CHANNEL10" caption="Channel 10 Software Selection" mask="0x400"/>
          <bitfield name="CHANNEL11" caption="Channel 11 Software Selection" mask="0x800"/>
        </register>
        <register name="PRICTRL" offset="0x8" rw="RW" size="1" initval="0x00" caption="Priority Control">
          <bitfield name="PRI" caption="Channel Priority Number" mask="0x7"/>
          <bitfield name="RREN" caption="Round-Robin Scheduling Enable" mask="0x80"/>
        </register>
        <register name="INTPEND" offset="0x10" rw="RW" size="2" initval="0x4000" caption="Channel Pending Interrupt">
          <bitfield name="ID" caption="Channel ID" mask="0x7"/>
          <bitfield name="OVR" caption="Channel Overrun" mask="0x100"/>
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x200"/>
          <bitfield name="READY" caption="Ready" mask="0x4000"/>
          <bitfield name="BUSY" caption="Busy" mask="0x8000"/>
        </register>
        <register name="INTSTATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Interrupt Status">
          <bitfield name="CHINT0" caption="Channel 0 Pending Interrupt" mask="0x1"/>
          <bitfield name="CHINT1" caption="Channel 1 Pending Interrupt" mask="0x2"/>
          <bitfield name="CHINT2" caption="Channel 2 Pending Interrupt" mask="0x4"/>
          <bitfield name="CHINT3" caption="Channel 3 Pending Interrupt" mask="0x8"/>
          <bitfield name="CHINT4" caption="Channel 4 Pending Interrupt" mask="0x10"/>
          <bitfield name="CHINT5" caption="Channel 5 Pending Interrupt" mask="0x20"/>
          <bitfield name="CHINT6" caption="Channel 6 Pending Interrupt" mask="0x40"/>
          <bitfield name="CHINT7" caption="Channel 7 Pending Interrupt" mask="0x80"/>
        </register>
        <register name="BUSYCH" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Busy Channels">
          <bitfield name="BUSYCH0" caption="Busy Channel 0" mask="0x1"/>
          <bitfield name="BUSYCH1" caption="Busy Channel 1" mask="0x2"/>
          <bitfield name="BUSYCH2" caption="Busy Channel 2" mask="0x4"/>
          <bitfield name="BUSYCH3" caption="Busy Channel 3" mask="0x8"/>
          <bitfield name="BUSYCH4" caption="Busy Channel 4" mask="0x10"/>
          <bitfield name="BUSYCH5" caption="Busy Channel 5" mask="0x20"/>
          <bitfield name="BUSYCH6" caption="Busy Channel 6" mask="0x40"/>
          <bitfield name="BUSYCH7" caption="Busy Channel 7" mask="0x80"/>
        </register>
        <register name="READYUSR" offset="0x1C" rw="R" size="4" initval="0xFFFFFFFF" caption="Ready Users">
          <bitfield name="READYUSR0" caption="Ready User for Channel 0" mask="0x1"/>
          <bitfield name="READYUSR1" caption="Ready User for Channel 1" mask="0x2"/>
          <bitfield name="READYUSR2" caption="Ready User for Channel 2" mask="0x4"/>
          <bitfield name="READYUSR3" caption="Ready User for Channel 3" mask="0x8"/>
          <bitfield name="READYUSR4" caption="Ready User for Channel 4" mask="0x10"/>
          <bitfield name="READYUSR5" caption="Ready User for Channel 5" mask="0x20"/>
          <bitfield name="READYUSR6" caption="Ready User for Channel 6" mask="0x40"/>
          <bitfield name="READYUSR7" caption="Ready User for Channel 7" mask="0x80"/>
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x020" size="0x8" count="12"/>
        <register name="USER" offset="0x120" rw="RW" size="1" count="52" initval="0x00" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0xF"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
      </value-group>
    </module>
    <module name="FPB" version="1.0.0" caption="Flash Patch and Breakpoint">
      <register-group name="FPB" caption="Flash Patch and Breakpoint">
        <register name="FP_CTRL" offset="0x0" rw="RW" size="4" access-size="4" caption="Flash Patch Control Register">
          <bitfield name="ENABLE" caption="Flash Patch global enable" mask="0x1"/>
          <bitfield name="KEY" caption="FP_CTRL write-enable key" mask="0x2"/>
          <bitfield name="NUM_CODE" caption="Number of implemented code comparators bits [3:0]" mask="0xF0"/>
          <bitfield name="NUM_LIT" caption="Number of literal comparators" mask="0xF00"/>
          <bitfield name="NUM_CODE_1" caption="Number of implemented code comparators bits [6:4]" mask="0x7000"/>
          <bitfield name="REV" caption="Revision" mask="0xF0000000"/>
        </register>
        <register name="FP_REMAP" offset="0x4" rw="R" size="4" access-size="4" caption="Flash Patch Remap Register">
          <bitfield name="REMAP" caption="Remap address" mask="0x1FFFFFE0"/>
          <bitfield name="RMPSPT" caption="Remap supported" mask="0x20000000"/>
        </register>
        <register name="FP_COMP" offset="0x8" rw="RW" size="4" access-size="4" count="4" caption="Flash Patch Comparator Register n">
          <mode name="BREAKPOINT"/>
          <mode name="DEFAULT"/>
          <bitfield name="BE" caption="Breakpoint enable" mask="0x1"/>
          <bitfield modes="DEFAULT" name="FPADDR" caption="Flash Patch address" mask="0x1FFFFFFC"/>
          <bitfield modes="DEFAULT" name="FE" caption="Flash Patch enable" mask="0x80000000"/>
          <bitfield modes="BREAKPOINT" name="BPADDR" caption="Breakpoint address" mask="0xFFFFFFFE"/>
        </register>
        <register name="FP_LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="FPB Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="FPB_FP_LAR__KEY"/>
        </register>
        <register name="FP_LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="FPB Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1"/>
          <bitfield name="SLK" caption="Software Lock status" mask="0x2"/>
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4"/>
        </register>
        <register name="FP_DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A03" caption="FPB Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
