Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/atdf/PIC32CM2532LE00100.atdf
      <value-group name="I2S_CLKCTRL__MCKSEL">
        <value name="GCLK" caption="GCLK_I2S_n is used as Master Clock n source" value="0x0"/>
        <value name="MCKPIN" caption="MCKn input pin is used as Master Clock n source" value="0x1"/>
      </value-group>
      <value-group name="I2S_CLKCTRL__SCKSEL">
        <value name="MCKDIV" caption="Divided Master Clock n is used as Serial Clock n source" value="0x0"/>
        <value name="SCKPIN" caption="SCKn input pin is used as Serial Clock n source" value="0x1"/>
      </value-group>
      <value-group name="I2S_CLKCTRL__SLOTSIZE">
        <value name="8" caption="8-bit Slot for Clock Unit n" value="0x0"/>
        <value name="16" caption="16-bit Slot for Clock Unit n" value="0x1"/>
        <value name="24" caption="24-bit Slot for Clock Unit n" value="0x2"/>
        <value name="32" caption="32-bit Slot for Clock Unit n" value="0x3"/>
      </value-group>
      <value-group name="I2S_TXCTRL__BITREV">
        <value name="MSBIT" caption="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)" value="0x0"/>
        <value name="LSBIT" caption="Transfer Data Least Significant Bit (LSB) first" value="0x1"/>
      </value-group>
      <value-group name="I2S_TXCTRL__DATASIZE">
        <value name="32" caption="32 bits" value="0x0"/>
        <value name="24" caption="24 bits" value="0x1"/>
        <value name="20" caption="20 bits" value="0x2"/>
        <value name="18" caption="18 bits" value="0x3"/>
        <value name="16" caption="16 bits" value="0x4"/>
        <value name="16C" caption="16 bits compact stereo" value="0x5"/>
        <value name="8" caption="8 bits" value="0x6"/>
        <value name="8C" caption="8 bits compact stereo" value="0x7"/>
      </value-group>
      <value-group name="I2S_TXCTRL__DMA">
        <value name="SINGLE" caption="Single DMA channel" value="0x0"/>
        <value name="MULTIPLE" caption="One DMA channel per data channel" value="0x1"/>
      </value-group>
      <value-group name="I2S_TXCTRL__EXTEND">
        <value name="ZERO" caption="Extend with zeroes" value="0x0"/>
        <value name="ONE" caption="Extend with ones" value="0x1"/>
        <value name="MSBIT" caption="Extend with Most Significant Bit" value="0x2"/>
        <value name="LSBIT" caption="Extend with Least Significant Bit" value="0x3"/>
      </value-group>
      <value-group name="I2S_TXCTRL__MONO">
        <value name="STEREO" caption="Normal mode" value="0x0"/>
        <value name="MONO" caption="Left channel data is duplicated to right channel" value="0x1"/>
      </value-group>
      <value-group name="I2S_TXCTRL__SLOTADJ">
        <value name="RIGHT" caption="Data is right adjusted in slot" value="0x0"/>
        <value name="LEFT" caption="Data is left adjusted in slot" value="0x1"/>
      </value-group>
      <value-group name="I2S_TXCTRL__TXDEFAULT">
        <value name="ZERO" caption="Output Default Value is 0" value="0x0"/>
        <value name="ONE" caption="Output Default Value is 1" value="0x1"/>
        <value name="HIZ" caption="Output Default Value is high impedance" value="0x3"/>
      </value-group>
      <value-group name="I2S_TXCTRL__TXSAME">
        <value name="ZERO" caption="Zero data transmitted in case of underrun" value="0x0"/>
        <value name="SAME" caption="Last data transmitted in case of underrun" value="0x1"/>
      </value-group>
      <value-group name="I2S_TXCTRL__WORDADJ">
        <value name="RIGHT" caption="Data is right adjusted in word" value="0x0"/>
        <value name="LEFT" caption="Data is left adjusted in word" value="0x1"/>
      </value-group>
      <value-group name="I2S_RXCTRL__BITREV">
        <value name="MSBIT" caption="Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)" value="0x0"/>
        <value name="LSBIT" caption="Transfer Data Least Significant Bit (LSB) first" value="0x1"/>
      </value-group>
      <value-group name="I2S_RXCTRL__CLKSEL">
        <value name="CLK0" caption="Use Clock Unit 0" value="0x0"/>
        <value name="CLK1" caption="Use Clock Unit 1" value="0x1"/>
      </value-group>
      <value-group name="I2S_RXCTRL__DATASIZE">
        <value name="32" caption="32 bits" value="0x0"/>
        <value name="24" caption="24 bits" value="0x1"/>
        <value name="20" caption="20 bits" value="0x2"/>
        <value name="18" caption="18 bits" value="0x3"/>
        <value name="16" caption="16 bits" value="0x4"/>
        <value name="16C" caption="16 bits compact stereo" value="0x5"/>
        <value name="8" caption="8 bits" value="0x6"/>
        <value name="8C" caption="8 bits compact stereo" value="0x7"/>
      </value-group>
      <value-group name="I2S_RXCTRL__DMA">
        <value name="SINGLE" caption="Single DMA channel" value="0x0"/>
        <value name="MULTIPLE" caption="One DMA channel per data channel" value="0x1"/>
      </value-group>
      <value-group name="I2S_RXCTRL__EXTEND">
        <value name="ZERO" caption="Extend with zeroes" value="0x0"/>
        <value name="ONE" caption="Extend with ones" value="0x1"/>
        <value name="MSBIT" caption="Extend with Most Significant Bit" value="0x2"/>
        <value name="LSBIT" caption="Extend with Least Significant Bit" value="0x3"/>
      </value-group>
      <value-group name="I2S_RXCTRL__MONO">
        <value name="STEREO" caption="Normal mode" value="0x0"/>
        <value name="MONO" caption="Left channel data is duplicated to right channel" value="0x1"/>
      </value-group>
      <value-group name="I2S_RXCTRL__SERMODE">
        <value name="RX" caption="Receive" value="0x0"/>
        <value name="PDM2" caption="Receive one PDM data on each serial clock edge" value="0x2"/>
      </value-group>
      <value-group name="I2S_RXCTRL__SLOTADJ">
        <value name="RIGHT" caption="Data is right adjusted in slot" value="0x0"/>
        <value name="LEFT" caption="Data is left adjusted in slot" value="0x1"/>
      </value-group>
      <value-group name="I2S_RXCTRL__WORDADJ">
        <value name="RIGHT" caption="Data is right adjusted in word" value="0x0"/>
        <value name="LEFT" caption="Data is left adjusted in word" value="0x1"/>
      </value-group>
    </module>
    <module name="ICB" version="1.0.0" caption="Implementation Control Block">
      <register-group name="ICB" caption="Implementation Control Block">
        <register name="ICTR" offset="0x4" rw="R" size="4" access-size="4" caption="Interrupt Controller Type Register">
          <bitfield name="INTLINESNUM" caption="Interrupt line set number" mask="0xF"/>
        </register>
        <register name="ACTLR" offset="0x8" rw="RW" size="4" access-size="4" caption="Auxiliary Control Register">
        </register>
      </register-group>
    </module>
    <module name="MCLK" id="U2234" version="3.1.0" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="CKSEL" caption="Clock Select" mask="0x4"/>
        </register>
        <register name="INTENCLR" offset="0x1" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x2" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x3" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x01" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="CPUDIV" offset="0x4" rw="RW" size="1" initval="0x01" caption="CPU Clock Division">
          <bitfield name="CPUDIV" caption="CPU Clock Division Factor" mask="0xFF" values="MCLK_CPUDIV__CPUDIV"/>
        </register>
        <register name="AHBMASK" offset="0x10" rw="RW" size="4" initval="0x00003FFF" caption="AHB Mask">
          <bitfield name="APBA_" caption="APBA AHB Clock Mask" mask="0x1"/>
          <bitfield name="APBB_" caption="APBB AHB Clock Mask" mask="0x2"/>
          <bitfield name="APBC_" caption="APBC AHB Clock Mask" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x8"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS AHB Clock Mask" mask="0x20"/>
          <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x40"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x80"/>
          <bitfield name="TRAM_" caption="TRAM AHB Clock Mask" mask="0x1000"/>
          <bitfield name="USB_" caption="USB AHB Clock Mask" mask="0x2000"/>
        </register>
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x00007FFF" caption="APBA Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x800"/>
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x1000"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x2000"/>
        </register>
        <register name="APBBMASK" offset="0x18" rw="RW" size="4" initval="0x00000037" caption="APBB Mask">
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Clock Enable" mask="0x10"/>
          <bitfield name="USB_" caption="USB APB Clock Enable" mask="0x20"/>
        </register>
        <register name="APBCMASK" offset="0x1C" rw="RW" size="4" initval="0x001FFFFF" caption="APBC Mask">
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Clock Enable" mask="0x10"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Clock Enable" mask="0x20"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Clock Enable" mask="0x40"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x80"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x100"/>
          <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x200"/>
          <bitfield name="TCC0_" caption="TCC0 APB Clock Enable" mask="0x400"/>
          <bitfield name="TCC1_" caption="TCC1 APB Clock Enable" mask="0x800"/>
          <bitfield name="TCC2_" caption="TCC2 APB Clock Enable" mask="0x1000"/>
          <bitfield name="TCC3_" caption="TCC3 APB Clock Enable" mask="0x2000"/>
          <bitfield name="ADC_" caption="ADC APB Clock Enable" mask="0x4000"/>
          <bitfield name="DAC_" caption="DAC APB Clock Enable" mask="0x8000"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x10000"/>
          <bitfield name="TRNG_" caption="TRNG APB Clock Enable" mask="0x20000"/>
          <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x40000"/>
          <bitfield name="I2S_" caption="I2S APB Clock Enable" mask="0x80000"/>
          <bitfield name="OPAMP_" caption="OPAMP APB Clock Enable" mask="0x100000"/>
        </register>
      </register-group>
      <value-group name="MCLK_CPUDIV__CPUDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MPU" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="MPU_TYPE" offset="0x0" rw="R" size="4" access-size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instructions and data address regions" mask="0x1"/>
          <bitfield name="DREGION" caption="Number of MPU data regions" mask="0xFF00"/>
        </register>
        <register name="MPU_CTRL" offset="0x4" rw="RW" size="4" access-size="4" caption="MPU Control Register">
          <bitfield name="ENABLE" caption="MPU enable" mask="0x1"/>
          <bitfield name="HFNMIENA" caption="HardFault, NMI enable" mask="0x2"/>
          <bitfield name="PRIVDEFENA" caption="Privileged default enable" mask="0x4"/>
        </register>
        <register name="MPU_RNR" offset="0x8" rw="RW" size="4" access-size="4" caption="MPU Region Number Register">
          <bitfield name="REGION" caption="Selected region number" mask="0xFF"/>
        </register>
        <register name="MPU_RBAR" offset="0xC" rw="RW" size="4" access-size="4" caption="MPU Region Base Address Register">
          <bitfield name="XN" caption="Execute Never" mask="0x1"/>
          <bitfield name="AP" caption="Access permissions" mask="0x6" values="MPU_RBAR__AP"/>
          <bitfield name="SH" caption="Shareability" mask="0x18" values="MPU_RBAR__SH"/>
          <bitfield name="BASE" caption="Base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="MPU_RLAR" offset="0x10" rw="RW" size="4" access-size="4" caption="MPU Region Limit Address Register">
          <bitfield name="EN" caption="Region enable" mask="0x1"/>
          <bitfield name="AttrInd" caption="Attribute Index" mask="0xE"/>
          <bitfield name="LIMIT" caption="Limit address" mask="0xFFFFFFE0"/>
        </register>
