Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.1.162/atdf/PIC32CM2532LE00100.atdf
        <register name="MPU_MAIR0" offset="0x30" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 0">
          <bitfield name="Attr0" caption="Attribute of MPU region 0" mask="0xFF"/>
          <bitfield name="Attr1" caption="Attribute of MPU region 1" mask="0xFF00"/>
          <bitfield name="Attr2" caption="Attribute of MPU region 2" mask="0xFF0000"/>
          <bitfield name="Attr3" caption="Attribute of MPU region 3" mask="0xFF000000"/>
        </register>
        <register name="MPU_MAIR1" offset="0x34" rw="RW" size="4" access-size="4" caption="MPU Memory Attribute Indirection Register 1">
          <bitfield name="Attr4" caption="Attribute of MPU region 4" mask="0xFF"/>
          <bitfield name="Attr5" caption="Attribute of MPU region 5" mask="0xFF00"/>
          <bitfield name="Attr6" caption="Attribute of MPU region 6" mask="0xFF0000"/>
          <bitfield name="Attr7" caption="Attribute of MPU region 7" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="MPU_RBAR__AP">
        <value name="RWPRIV" caption="Read/write by privileged code only" value="0"/>
        <value name="RWANY" caption="Read/write by any privilege level" value="1"/>
        <value name="RPRIV" caption="Read-only by privileged code only" value="2"/>
        <value name="RANY" caption="Read-only by any privilege level" value="3"/>
      </value-group>
      <value-group name="MPU_RBAR__SH">
        <value name="NO" caption="Non-shareable" value="0"/>
        <value name="OUTER" caption="Outer shareable" value="2"/>
        <value name="INNER" caption="Inner shareable" value="3"/>
      </value-group>
    </module>
    <module name="NVIC" version="1.0.0" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register name="NVIC_ISER" offset="0x0" rw="RW" size="4" access-size="4" count="3" caption="Interrupt Set Enable Register n">
          <bitfield name="SETENA" caption="Set enable" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_ICER" offset="0x80" rw="RW" size="4" access-size="4" count="3" caption="Interrupt Clear Enable Register n">
          <bitfield name="CLRENA" caption="Clear enable" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_ISPR" offset="0x100" rw="RW" size="4" access-size="4" count="3" caption="Interrupt Set Pending Register n">
          <bitfield name="SETPEND" caption="Set pending" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_ICPR" offset="0x180" rw="RW" size="4" access-size="4" count="3" caption="Interrupt Clear Pending Register n">
          <bitfield name="CLRPEND" caption="Clear pending" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_IABR" offset="0x200" rw="R" size="4" access-size="4" count="3" caption="Interrupt Active Bit Register n">
          <bitfield name="ACTIVE" caption="Active state" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_ITNS" offset="0x280" rw="RW" size="4" access-size="4" count="3" caption="Interrupt Target Non-secure Register n">
          <bitfield name="ITNS" caption="Interrupt Targets Non-secure" mask="0xFFFFFFFF"/>
        </register>
        <register name="NVIC_IPR" offset="0x300" rw="RW" size="4" access-size="4" count="18" caption="Interrupt Priority Register n">
          <bitfield name="PRI_N0" caption="Priority of interrupt number 4n+0" mask="0xFF"/>
          <bitfield name="PRI_N1" caption="Priority of interrupt number 4n+1" mask="0xFF00"/>
          <bitfield name="PRI_N2" caption="Priority of interrupt number 4n+2" mask="0xFF0000"/>
          <bitfield name="PRI_N3" caption="Priority of interrupt number 4n+3" mask="0xFF000000"/>
        </register>
      </register-group>
    </module>
    <module name="NVMCTRL" id="U2802" version="1.1.0" caption="Non-Volatile Memory Controller">
      <register-group name="NVMCTRL" caption="Non-Volatile Memory Controller">
        <register name="CTRLA" offset="0x0" rw="W" size="2" initval="0x0000" caption="Control A">
          <bitfield name="CMD" caption="Command" mask="0x7F" values="NVMCTRL_CTRLA__CMD"/>
          <bitfield name="CMDEX" caption="Command Execution" mask="0xFF00" values="NVMCTRL_CTRLA__CMDEX"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="RWS" caption="NVM Read Wait States" mask="0x1E"/>
          <bitfield name="SLEEPPRM" caption="Power Reduction Mode during Sleep" mask="0x300" values="NVMCTRL_CTRLB__SLEEPPRM"/>
          <bitfield name="FWUP" caption="fast wake-up" mask="0x800"/>
          <bitfield name="READMODE" caption="NVMCTRL Read Mode" mask="0x30000" values="NVMCTRL_CTRLB__READMODE"/>
          <bitfield name="CACHEDIS" caption="Cache Disable" mask="0x40000"/>
        </register>
        <register name="CTRLC" offset="0x8" rw="RW" size="1" initval="0x01" caption="Control C">
          <bitfield name="MANW" caption="Manual Write" mask="0x1"/>
        </register>
        <register name="EVCTRL" offset="0xA" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="AUTOWEI" caption="Auto Write Event Enable" mask="0x1"/>
          <bitfield name="AUTOWINV" caption="Auto Write Event Polarity Inverted" mask="0x2"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="DONE" caption="NVM Done Interrupt Clear" mask="0x1"/>
          <bitfield name="PROGE" caption="Programming Error Status Interrupt Clear" mask="0x2"/>
          <bitfield name="LOCKE" caption="Lock Error Status Interrupt Clear" mask="0x4"/>
          <bitfield name="NVME" caption="NVM Error Interrupt Clear" mask="0x8"/>
          <bitfield name="KEYE" caption="Key Write Error Interrupt Clear" mask="0x10"/>
        </register>
